In [1]:
people = {
    'first':['dudung','eman','Bobi','Saya'],
    'last':['xuherman', 'guherman','dubobi','Kayaraya'],
    'email':['dudung@gmail.com','emangnye@gmail.com','bobie2yahoo.com','sayakayaraya@gmail.com']
}

In [2]:
import pandas as pd

In [3]:
df = pd.DataFrame(people)

In [4]:
df

    first      last                   email
0  dudung  xuherman        dudung@gmail.com
1    eman  guherman      emangnye@gmail.com
2    Bobi    dubobi         bobie2yahoo.com
3    Saya  Kayaraya  sayakayaraya@gmail.com

#### kita akan urutkan nama pada kolom first

In [5]:
df.sort_values(by='first')

    first      last                   email
2    Bobi    dubobi         bobie2yahoo.com
3    Saya  Kayaraya  sayakayaraya@gmail.com
0  dudung  xuherman        dudung@gmail.com
1    eman  guherman      emangnye@gmail.com

In [6]:
df.sort_values(by='first', ascending=False)

    first      last                   email
1    eman  guherman      emangnye@gmail.com
0  dudung  xuherman        dudung@gmail.com
3    Saya  Kayaraya  sayakayaraya@gmail.com
2    Bobi    dubobi         bobie2yahoo.com

#### sort ini defaultnya adalah asc (dari a ke z), untuk mengurutkan sebaliknya kita gunakan asc=False

#### kita akan mengurutkan kolom last dulu dari z ke a (desc) , lalu diikuti kolom first

In [8]:
df.sort_values(by=['last','first'], ascending=[False,True])

    first      last                   email
0  dudung  xuherman        dudung@gmail.com
1    eman  guherman      emangnye@gmail.com
2    Bobi    dubobi         bobie2yahoo.com
3    Saya  Kayaraya  sayakayaraya@gmail.com

#### Kita buat permanen tabel ini, dengan menambahkan inplace=True

In [10]:
df.sort_values(by=['last','first'], ascending=[False,True], inplace=True)

In [11]:
df

    first      last                   email
0  dudung  xuherman        dudung@gmail.com
1    eman  guherman      emangnye@gmail.com
2    Bobi    dubobi         bobie2yahoo.com
3    Saya  Kayaraya  sayakayaraya@gmail.com

#### supaya index nya tersusun dengan rapi, walaupun sudah rapi ya ini,

In [12]:
df.sort_index()

    first      last                   email
0  dudung  xuherman        dudung@gmail.com
1    eman  guherman      emangnye@gmail.com
2    Bobi    dubobi         bobie2yahoo.com
3    Saya  Kayaraya  sayakayaraya@gmail.com

#### Kita ke Pandas demo, menerapkan sorting data